---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.WiringType.Arc
enum: Autodesk.Revit.DB.Electrical.WiringType
zh: 弧、圆弧
source: html/fb484864-f9d0-7335-1f91-d7ac587f15fb.htm
---
# Autodesk.Revit.DB.Electrical.WiringType.Arc

**中文**: 弧、圆弧

Arc wiring is used to indicate wiring that is concealed within walls, ceilings, or floors.